FemDesign.Loads.TopBotLocationValue
topbottom_value

FemDesign.Loads.TopBotLocationValue._topVal
Top value

FemDesign.Loads.TopBotLocationValue._bottomVal
Bottom value

FemDesign.Loads.TopBotLocationValue.#ctor
Parameterless constructor for serialization.

FemDesign.Loads.TopBotLocationValue.#ctor(FemDesign.Geometry.Point3d,System.Double,System.Double)
Construct top bottom location value by point, top value and bottom value.

FemDesign.Loads.TopBotLocationValue.GetFdPoint
Convert coordinates to FdPoint.